<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"a73e976aec56eae74df4b5fa0661342fab7d2a02448cc45cbf8fe7d1af2aac49","plan_job_ref":"Job Test plan target and replace #403 at https://github.com/dflook/terraform-github-actions/actions/runs/7462096177","plan_out_hash":"a60abc421eae8e1bc73132481576f63a54f9fbe798bd250f2ab97a74dbffb35c","plan_hash":"a3090894f2f6451dee2c0e1852a61ff11f8b2ed3594b25c53b5ed590af1bd138","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "0U6CnKGFil" -> (known after apply)
!~  foreach = "rTnMJY54Vh" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #403](https://github.com/dflook/terraform-github-actions/actions/runs/7462096177)